// คุณเป็นเจ้าของร้านอาหารพ่อครัวหัวไข่ ที่มีจุดเด่นของร้านคือเมนูต่าง ๆ ทำจากไข่ ซึ่งร้านไข่ดีมากจนคุณไม่สามารถปลีกตัวมารับออเดอร์ได้ คุณจึงได้เขียนโปรแกรมมาเพื่อรับออเดอร์ ซุ่งมีรายละเอียดดังนี้
// - รับอินพุต 2 ตัวที่เป็นสายอักขระ และจำนวนเต็ม (order, amount) เพื่อแจ้งยอดเงินที่ลูกค้าต้องชำระในการสั่งอาหาร โดยเงื่อยไขของโปรแกรม มีดังนี้
// - ถ้าลูกค้าสั่ง (order) ไข่ดาว ราคาที่ลูกค้าต้องจ่ายเท่ากับ จำนวนไข่ดาว (amount) x 7
// - ถ้าลูกค้าสั่ง (order) ไข่เจียว ราคาที่ลูกค้าต้องจ่ายเท่ากับ จำนวนไข่เจียว (amount) x 10
// - ถ้าลูกค้าสั่ง (order) ไข่ต้ม ราคาที่ลูกค้าต้องจ่ายเท่ากับ จำนวนไข่ต้ม (amount) x 5
// - นอกจากนั้นให้พิมพ์ 'ร้านเรามี ไข่ดาว, ไข่เจียว, ไข่ต้ม'

function kitchenKai(order, amount) {
  if (order === "ไข่ดาว") {
    result = amount * 7;
  } else if (order === "ไข่เจียว") {
    result = amount * 10;
  } else if (order === "ไข่ต้ม") {
    result = amount * 5;
  } else {
    console.log("ร้านเรามีแค่ไข่ดาว ไข่เจียว แลไข่ต้มจ้ะ นายจ๋าา");
  }
  console.log(result);
}

kitchenKai("ไข่ดาว", 10);
kitchenKai("ไข่เจียว", 10);
kitchenKai("ไข่ต้ม", 10);
kitchenKai("ไข่เยี่ยวม้า", 10);
