// เขียนโปรแกรมรับอินพุต 1 ตัว เป็นจำนวนเงินในหน่วยบาท (จำนวนจริง) และตรวจสอบว่า จำนวนที่รับมามีค่ามากกว่า 0 หรือไม่
// - ถ้ามีค่ามากกว่า 0 ให้คำนวณจำนวนเงินในหน่วยดอลลาร์ที่สามารถแลกได้ และกำไรที่ธนาคารได้ โดยที่ธนาคารขายเงินดอลล่าร์ที่ราคา 32.80 บาท (ซึ่งธนาคารจะได้กำไร 0.30 บาท) พิมพ์จำนวนเงินดอลล่าที่แลกได้และกำไรของธนาคาร
// - ถ้ามีค่าน้อยกว่าหรือเท่ากับ 0 ให้พิมพ์ "you don't have money"

function bahtToUsd(baht) {
  if (baht > 0) {
    const USD = baht / 32.8;
    const profit = USD * 0.3;
    console.log(
      "สามารถแลกได้ " + USD + " USD" + " และธนาคารได้กำไร " + profit + " บาท"
    );
  } else {
    console.log("ว้ายย หมดตูดดดด");
  }
}

bahtToUsd(32.8);
bahtToUsd(1000);
bahtToUsd(0);
bahtToUsd(-100);
