// คุณเป็นโปรแกรมเมอร์ที่ร้านขายสินค้าแบรนด์เนมชื่อดังแห่งหนึ่ง คุณได้รับมอบหมายเพื่อเขียนโปรแกรมรายละเอียดดังนี้
// - รับอินพุต 1 ตัวที่เป็นจำนวนจริง (bill) เพื่อคำนวณยอดเงินที่ต้องจ่ายจากการซื้อสินค้า โดยที่ร้านค้ามีเงื่อนไขดังนี้
// - ถ้าซื้อสินค้าราคารวมกันตั้งแต่ 1,000 บาทขึ้นไปจะลดราคาให้ 10%
// - ถ้าซื้อสินค้าราคารวมกันตั้งแต่ 10,000 บาทขึ้นไปจะลดราคาให้ 15%
// - ถ้าซื้อสินค้าราคารวมกันตั้งแต่ 50,000 บาทขึ้นไปจะลดราคาให้ 20%
// - จงคำนวณยอดเงินที่ต้อง่ายจากการซื้อสินค้าแลพพิมพ์ออกมา

function shoppingCart(bill) {
  if (bill >= 50000) {
    discount = (bill * 20) / 100;
    result = bill - discount;
  } else if (bill >= 10000) {
    discount = (bill * 15) / 100;
    result = bill - discount;
  } else if (bill >= 1000) {
    discount = (bill * 10) / 100;
    result = bill - discount;
  }
  console.log(result);
}

shoppingCart(1000);
shoppingCart(1001);
shoppingCart(10000);
shoppingCart(10001);
shoppingCart(50000);
shoppingCart(50001);
