// คุณเป็นตำรวจกรมทางหลวง หน้าที่ของคุณคือลงโทษผู้ที่ขับรถเร็วเกินอัตราที่กำหนด ปัญหาคือมีผู้ทำผิดเยอะมากจนไม่สามารถทำงานได้ทัน คุณจึงได้เขียนโปรแกรมขึ้นมาโดยมีรายละเอียด ดังนี้
// - รับอินพุต 1 ตัวที่เป็นจำนวนจริง (velocity) เพื่อพิจาณาโทษจากความเร็วที่ขับโดยมีเงื่อนไขดังนี้
// - ถ้าความเร็ว (velocity) มากกว่า 120 กิโลเมตร/ชั่วโมง ให้พิมพ์ 'ออกใบสั่ง'
// - แต่ถ้าไม่ขับเร็วกว่า 120 กิโลเมตร /ชั่วโมง จะไม่ดำเนินการใด ๆ

function tooFastOrNot(velocity) {
  if (velocity >= 120) {
    console.log("ออกใบสั่ง");
  }
}

tooFastOrNot(120);
tooFastOrNot(100);
tooFastOrNot(200);
