// คุณเป็นโปรแกรมเมอร์ที่ห้างสรรพสินค้าชื่อดังแห่งหนึ่ง คุณได้รับมอบหมายให้เขียนโปรแกรม ซึ่งมีรายละเอียดดังนี้
// - รับอินพุต 3 ตัวที่เป็นจำนวนเต็ม (bill, hour, minute) เพื่อคำนวณค่าจอดรถ โดยมีเงื่อนไขดังนี้
// - ถ้า bill มากกว่าหรือเท่ากับ 1000 จะจอดรถฟรี 4 ชั่วโมง หลังจากนั้นจะเสียค่าจอดรถชั่วโมงละ 30 บาท
// - ถ้า bill น้อยกว่า 1000 จะจอดรถฟรี 1 ชั่วโมง หลังจากนั้นจะเสียค่าจอดชั่วโมงละ 30 บาท
// - เศษของชั่วโมงนับเป็น 1 ชั่วโมง
// - เมื่อคำนวณค่าจอดรถเสร็จให้ทำการพิมพ์ออกมา

function carPark2(bill, hour, minute) {
  if (bill >= 1000) {
    if (hour >= 4) {
    
  
    } else {
      console.log("จอดฟรีไปเลยพี่จ๋าา");
    }
  }
}

carPark2(1000, 4, 0);
carPark2(1000, 4, 1);
carPark2(1000, 5, 0);
carPark2(1000, 5, 1);
