// คุณเป็นโปรแกรมเมอร์ในธนาคารแห่งหนึ่ง ลูกค้าของธนาคารแห่งนี้ส่วนใหญ่แล้วเป็นคนอเมริกาและคนญี่ปุ่น โดยปกติลูกค้าจะมาใช้บริการและเงินบาท คุณได้รับมอบหมายให้เขียนโปรแกรมซึ่งมีรายละเอียดดังนี้
// - รับอินพุต 2 ตัวที่เป็นสายอักขระ และจำนวนจริง (currency, amount) เพื่อคำนวณจำนวนเงินบาที่ลูกค้าแลกได้และพิมพ์ออกมา โดยมีเงื่อนไขดังนี้
// - ถ้า currency เท่ากับ 'USD' จำนวนเงินในหน่วยบาทที่แลกได้เป็นดังนี้ (THB = USD x 32.5)
// - ถ้า currency เท่ากับ 'JPY' จำนวนเงินในหน่วยบาทที่แลกได้เป็นดังนี้ (THB = JPY x 0.29)

function currencyExchange(currency, amount) {
  if (currency === "USD") {
    THB = amount * 32.5;
  } else if (currency === "JPY") {
    THB = amount * 0.29;
  }
  console.log(THB);
}

currencyExchange("USD", 100);
currencyExchange("JPY", 100);
