// คุณเป็นเจ้าของร้านอาหารชื่อพ่อครัวหัวไข่ เนื่องจากคุณเป็นนักธุรกิจที่เก่งคุณจึงวางแผนเพื่อกระตุ้นยอดขายโดยที่คุณไม่ต้องลงทุนเพิ่ม สิ่งที่คุณคิดได้ก็คือ การแนะนำสินค้าเพิ่มเติมหลังจากลูกค้าสั่งออเดอร์แรกเสร็จ โปรแกรมที่คุณออกแบบมามีดังนี้
// - รับอินพุต 1 ตัวที่เป็นสายอักขระ (order) เพื่อแนะนำสินค้าเพิ่มเติมโดยเงื่อนไขของโปรแกรมมีดังนี้
// - ถ้าลูกค้าสั่ง (order) ไข่ดาว ให้พิมพ์ 'แนะนำให้สั่งคู่กับต้มจืดไข่น้ำ'
// - ถ้าลูกค้าสั่ง (order) ไข่เจียว ให้พิมพ์ 'แนะนำให้สั่งคู่กับไข่ลูกเขย'
// - ถ้าลูกค้าสั่ง (order) ไข่ต้ม ให้พิมพ์ 'แนะนำให้สั่งคู่กับยำไข่ดาว'

function cookKai(order) {
  if (order === "ไข่ดาว") {
    console.log("แนะนำให้สั่งคู่กับต้มจืดไข่น้ำนะจ๊ะะ");
  } else if (order === "ไข่เจียว") {
    console.log("แนะนำให้สั่งคู่กับไข่ลูกเขยนะจ๊ะะ");
  } else if (order === "ไข่ต้ม") {
    console.log("แนะนำให้สั่งคู่กับยำไข่ดาวนะจ๊ะะ");
  }
}

cookKai("ไข่ดาว");
cookKai("ไข่เจียว");
cookKai("ไข่ต้ม");
