// คุณเป็นฟิตเนสเทรนเนอร์ในยิมชื่อดังแห่งหนึ่ง ในแต่ละวันมีคนมาขอคำปรึกษาเบื้องต้นเกี่ยวกับการดูแลรูปร่างมากมาย คุณหมดเวลาการให้คำปรึกษามาก จึงคิอยากสร้างโปรแกรมขึ้นมาโดยมีรายละเอียดดังนี้
// - รับอินพุต 3 ตัวที่เป็นสายอักขระ , จำนวนจริง , และจำนวนเต็ม (gender, weight, height) เพื่อให้คำแนะนำสุขภาพโดยมีเงื่อนไขดังนี้
// - ถ้าเป็นเพศชาย ให้พิจารณาว่าน้ำหนัก (กิโลกรัม) มากกว่าส่วนสูง (เซนติเมตร) -100 หรือไม่
//     - ถ้ามากกว่าให้พิมพ์ 'ควรออกกำลังกาย'
//     - ถ้าไม่มากกว่าให้พิมพ์ 'คุณผู้ชายหุ่นดีเยี่ยม'
// - ถ้าเป็นเพศหญิง ให้พิจารณาว่าน้ำหนัก (กิโลกรัม) มากกว่าส่วนสูง (เซนติเมตร) -110 หรือไม่
//     - ถ้ามากกว่าให้พิมพ์ 'ควรออกกำลังกาย'
//     - ถ้าไม่มากกว่าให้พิมพ์ 'คุณผู้หญิงหุ่นดีเยี่ยม'

function fitness(gender, weight, height) {
  if (gender === "ผู้ชาย") {
    if (weight >= height - 100) {
      console.log("ควรออกกำลังกายนะจ๊ะะ");
    } else {
      console.log("คุณผู้ชายหุ่นดีเจี่ยมม แก๋วเลยย");
    }
  } else if (gender === "ผู้หญิง") {
    if (weight >= height - 110) {
      console.log("ควรออกกกำลังกายนะจ๊ะะะ");
    } else {
      console.log("คุณผู้หญิงหุ่นดีเจี่ยม แก่วเลยย");
    }
  }
}

fitness("ผู้ชาย", 80, 190);
fitness("ผู้ชาย", 80, 180);
fitness("ผู้ชาย", 95, 190);
fitness("ผู้หญิง", 60, 180);
fitness("ผู้หญิง", 70, 180);
fitness("ผู้หญิง", 80, 180);
