// หอยทากปีนขึ้นไป 7 ฟุตในแต่ละวันและถอยกลับ 2 ฟุตในแต่ละคืน หอยทากจะใช้เวลากี่วันจึงจะออกจากบ่อน้ำที่มีความลึกที่กำหนด?
// อินพุตตัวอย่าง : 31

// ตัวอย่างผลลัพธ์ : 6

// คำอธิบาย: มาทำลายระยะทางที่หอยทากครอบคลุมในแต่ละวัน:
// วันที่ 1 : 7-2 = 5
// วันที่ 2 : 5+7-2 = 10
// วันที่ 3 : 10+7-2 = 15
// วันที่ 4 : 15+7-2 = 20
// วันที่ 5 : 20+7-2 = 25
// วันที่ 6 : 25+7-2 = 32

// ดังนั้นในวันที่ 6 หอยทากจะสูงถึง 32 ฟุต และออกจากบ่อน้ำในตอนกลางวัน โดยคืนนั้นไม่ลื่นไถลกลับ

function snailClimbs(dept) {
  let distanceAll = 0;
  let distanceDay = 0;

  let i = 1;

  for (; i <= dept; i++) {
    distanceDay = distanceAll + 7;
    distanceAll = distanceDay - 2;

    console.log(
      `วันที่ ${i} หอยทากเดินตอนกลางวันได้ ${distanceDay} ฟุต หากยังไม่พ้น ตอนกลางคืนจะร่วงลงไป 2 ฟุต จึงเหลือ ${distanceAll} ฟุต`
    );

    if (distanceDay >= dept) {
      break;
    }
  }
  console.log(`ดังนั้น หอยทากจะหลุดจากบ่อน้ำในตอนกลางวัน วันที่ ${i}`);
}

snailClimbs(31);
